# -*- coding: utf-8 -*-

KHANBANK_NAME_LOWER = 'khanbank'
KHANBANK_NAME_UPPER = 'KHANBANK'
CODE_MONGOL = 'MN'
ENCTYPTION_KEY = 'aj_oykbsi_5j1l4pJkpYdKJrS1jojcCQqGU4jN-nNY4='
BANKS = [
    {
        "name": "Төв монгол банк",
        "bic": 10000
    },
    {
        "name": "Капитал банк",
        "bic": 20000
    },
    {
        "name": "Худалгаа хөгжлийн банк",
        "bic": 40000
    },
    {
        "name": "Хаан банк",
        "bic": 50000
    },
    {
        "name": "Голомт банк",
        "bic": 150000
    },
    {
        "name": "Тээвэр хөгжлийн банк",
        "bic": 190000
    },
    {
        "name": "Ариг банк",
        "bic": 210000
    },
    {
        "name": "Кредит банк",
        "bic": 220000
    },
    {
        "name": "Улаанбаатар хотын банк",
        "bic": 260000
    },
    {
        "name": "Үндэсний хөрөнгө оруулалтын банк",
        "bic": 290000
    },
    {
        "name": "Капитрон банк",
        "bic": 300000
    },
    {
        "name": "Хас банк",
        "bic": 320000
    },
    {
        "name": "Чингис хаан банк",
        "bic": 330000
    },
    {
        "name": "Төрийн банк",
        "bic": 340000
    },
    {
        "name": "Хөгжлийн банк",
        "bic": 360000
    },
    {
        "name": "Богд Банк",
        "bic": 380000
    },
    {
        "name": "Төрийн сан",
        "bic": 900000
    },
    {
        "name": "Арилжааны төлбөр тооцооны төв",
        "bic": 940000
    },
    {
        "name": "ҮЦ Төвлөрсөн хадгаламжийн төв",
        "bic": 950000
    },
    {
        "name": "МОБИФИНАНС ББСБ",
        "bic": 500000
    }
]
